<a href="https://colab.research.google.com/github/wcj365/python-stats-dataviz/blob/master/examples/python_dp.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
!pip install python-dp

Collecting python-dp
  Downloading python_dp-1.1.1-cp37-cp37m-manylinux1_x86_64.whl (3.5 MB)
     |████████████████████████████████| 3.5 MB 5.1 MB/s
Installing collected packages: python-dp
Successfully installed python-dp-1.1.1

In [3]:
import pydp as dp # by convention our package is to be imported as dp (dp for Differential Privacy!)
from pydp.algorithms.laplacian import BoundedSum, BoundedMean, Count, Max
import pandas as pd
import statistics 
import numpy as np
import matplotlib.pyplot as plt

In [6]:
url1 = 'https://raw.githubusercontent.com/OpenMined/PyDP/dev/examples/Tutorial_4-Launch_demo/data/01.csv'
df1 = pd.read_csv(url1)
df1.head()

   id first_name  ... sales_amount       state
0   1   Osbourne  ...        31.94     Florida
1   2      Glynn  ...        12.46  California
2   3       Jori  ...       191.14    Colorado
3   4     Garald  ...       126.58       Texas
4   5      Mercy  ...        68.32     Florida

[5 rows x 6 columns]

In [9]:
URL = "https://raw.githubusercontent.com/OpenMined/PyDP/dev/examples/Tutorial_4-Launch_demo/data"

df_list = []
for i in range(1,6):
    url = URL + "/0" + str(i) + ".csv"
    print(url)
    df = pd.read_csv(url)
    df_list.append(df)

df = pd.concat(df_list)
df.head()

https://raw.githubusercontent.com/OpenMined/PyDP/dev/examples/Tutorial_4-Launch_demo/data/01.csv
https://raw.githubusercontent.com/OpenMined/PyDP/dev/examples/Tutorial_4-Launch_demo/data/02.csv
https://raw.githubusercontent.com/OpenMined/PyDP/dev/examples/Tutorial_4-Launch_demo/data/03.csv
https://raw.githubusercontent.com/OpenMined/PyDP/dev/examples/Tutorial_4-Launch_demo/data/04.csv
https://raw.githubusercontent.com/OpenMined/PyDP/dev/examples/Tutorial_4-Launch_demo/data/05.csv

   id first_name  ... sales_amount       state
0   1   Osbourne  ...        31.94     Florida
1   2      Glynn  ...        12.46  California
2   3       Jori  ...       191.14    Colorado
3   4     Garald  ...       126.58       Texas
4   5      Mercy  ...        68.32     Florida

[5 rows x 6 columns]

In [10]:
df.shape

(5000, 6)

In [11]:
df2 = df[1:]
df2.shape

(4999, 6)

In [15]:
total = df["sales_amount"].sum()

In [16]:
total2 = df2["sales_amount"].sum()

In [17]:
total - total2

31.940000000060536

In [26]:
dp = BoundedSum(epsilon= 1.5, lower_bound =  5, upper_bound = 250, dtype ='float') 

dp_sum = dp.quick_result(df['sales_amount'].to_list())
dp_sum = round(dp_sum, 2)
print(dp_sum)

dp_sum2 = dp.quick_result(df2['sales_amount'].to_list())
dp_sum2 = round(dp_sum2, 2)
print(dp_sum2)
print(dp_sum - dp_sum2)

636663.06
636519.25
143.81000000005588


## observations.

- Now that we've calculated the differentially private sum on the original and the second dataset, it's straightforward to verify that that the differentially private sums are not equal to sums under the non-differentially private setting.
- Also, the difference is no longer equal to the amount that Osbourne spent indicating that membership attacks would now be unsuccessful, regardless of access to any other customer records.
- Interestingly, the differentially private sum values are still comparable and are not very different.
- We've therefore succeeded in ensuring differential privacy in our simple example!